modm-ext/archive-stmicro-svd/header_stm32h7b3aii6q.svd
      <register>
        <name>RFL</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RFL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TDR</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RDR</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OR</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TBYP</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CLASS</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>OPAMP</name>
      <baseAddress>0x40009000</baseAddress>
      <register>
        <name>CSR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OPAMPxEN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FORCEVP</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>VPSEL</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>VMSEL</name>
            <bitOffset>5</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OPAHSM</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CALON</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CALSEL</name>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PGGAIN</name>
            <bitOffset>14</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>USERTRIM</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSTREF</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CALOUT</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OTR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TRIMOFFSETN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>TRIMOFFSETP</name>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HSOTR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TRIMHSOFFSETN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>TRIMHSOFFSETP</name>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>OPAMP1</name>
      <baseAddress>0x40009000</baseAddress>
      <register>
        <name>CSR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OPAMPxEN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FORCEVP</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>VPSEL</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>VMSEL</name>
            <bitOffset>5</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OPAHSM</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CALON</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CALSEL</name>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PGGAIN</name>
            <bitOffset>14</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>USERTRIM</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSTREF</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CALOUT</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OTR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TRIMOFFSETN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>TRIMOFFSETP</name>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HSOTR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TRIMHSOFFSETN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>TRIMHSOFFSETP</name>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>OPAMP2</name>
      <baseAddress>0x40009010</baseAddress>
      <register>
        <name>CSR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OPAMPxEN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>FORCEVP</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>VPSEL</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>VMSEL</name>
            <bitOffset>5</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>OPAHSM</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CALON</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CALSEL</name>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PGGAIN</name>
            <bitOffset>14</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>USERTRIM</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSTREF</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CALOUT</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OTR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TRIMOFFSETN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>TRIMOFFSETP</name>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>HSOTR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TRIMHSOFFSETN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>TRIMHSOFFSETP</name>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>MDIOS</name>
      <baseAddress>0x40009400</baseAddress>
      <register>
        <name>CR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WRIE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RDIE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EIE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DPC</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PORT_ADDRESS</name>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>WRFR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CWRFR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>RDFR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRDFR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PERF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SERF</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TERF</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CLRFR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR0</name>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR1</name>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR2</name>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR3</name>
        <addressOffset>0x10c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR4</name>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR5</name>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR6</name>
        <addressOffset>0x118</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR7</name>
        <addressOffset>0x11c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR8</name>
        <addressOffset>0x120</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR9</name>
        <addressOffset>0x124</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR10</name>
        <addressOffset>0x128</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR11</name>
        <addressOffset>0x12c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR12</name>
        <addressOffset>0x130</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR13</name>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR14</name>
        <addressOffset>0x138</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR15</name>
        <addressOffset>0x13c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR16</name>
        <addressOffset>0x140</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR17</name>
        <addressOffset>0x144</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR18</name>
        <addressOffset>0x148</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR19</name>
        <addressOffset>0x14c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR20</name>
        <addressOffset>0x150</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR21</name>
        <addressOffset>0x154</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR22</name>
        <addressOffset>0x158</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR23</name>
        <addressOffset>0x15c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR24</name>
        <addressOffset>0x160</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR25</name>
        <addressOffset>0x164</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR26</name>
        <addressOffset>0x168</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR27</name>
        <addressOffset>0x16c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR28</name>
        <addressOffset>0x170</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR29</name>
        <addressOffset>0x174</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR30</name>
        <addressOffset>0x178</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR31</name>
        <addressOffset>0x17c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR0</name>
        <addressOffset>0x180</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR1</name>
        <addressOffset>0x184</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR2</name>
        <addressOffset>0x188</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR3</name>
        <addressOffset>0x18c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR4</name>
        <addressOffset>0x190</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR5</name>
        <addressOffset>0x194</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR6</name>
        <addressOffset>0x198</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR7</name>
        <addressOffset>0x19c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR8</name>
        <addressOffset>0x1a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR9</name>
        <addressOffset>0x1a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR10</name>
        <addressOffset>0x1a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR11</name>
        <addressOffset>0x1ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR12</name>
        <addressOffset>0x1b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR13</name>
        <addressOffset>0x1b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR14</name>
        <addressOffset>0x1b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR15</name>
        <addressOffset>0x1bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR16</name>
        <addressOffset>0x1c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR17</name>
        <addressOffset>0x1c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR18</name>
        <addressOffset>0x1c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR19</name>
        <addressOffset>0x1cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR20</name>
        <addressOffset>0x1d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR21</name>
        <addressOffset>0x1d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR22</name>
        <addressOffset>0x1d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR23</name>
        <addressOffset>0x1dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR24</name>
        <addressOffset>0x1e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR25</name>
        <addressOffset>0x1e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR26</name>
        <addressOffset>0x1e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR27</name>
        <addressOffset>0x1ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR28</name>
        <addressOffset>0x1f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR29</name>
        <addressOffset>0x1f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR30</name>
        <addressOffset>0x1f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR31</name>
        <addressOffset>0x1fc</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>FDCAN1</name>
      <baseAddress>0x4000a000</baseAddress>
      <register>
        <name>CREL</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DAY</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>MON</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>YEAR</name>
            <bitOffset>16</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>SUBSTEP</name>
            <bitOffset>20</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>STEP</name>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>REL</name>
            <bitOffset>28</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ENDN</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ETV</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DBTP</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DSJW</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DTSEG2</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DTSEG1</name>
            <bitOffset>8</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>DBRP</name>
            <bitOffset>16</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>TDC</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>TEST</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LBCK</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TX</name>
            <bitOffset>5</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>RX</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RWD</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>WDC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>WDV</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
