modm-ext/archive-stmicro-svd/header_stm32h7b3aii6q.svd
      <register>
        <name>LUT.114</name>
        <addressOffset>0x11c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.115</name>
        <addressOffset>0x11cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.116</name>
        <addressOffset>0x11d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.117</name>
        <addressOffset>0x11d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.118</name>
        <addressOffset>0x11d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.119</name>
        <addressOffset>0x11dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.120</name>
        <addressOffset>0x11e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.121</name>
        <addressOffset>0x11e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.122</name>
        <addressOffset>0x11e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.123</name>
        <addressOffset>0x11ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.124</name>
        <addressOffset>0x11f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.125</name>
        <addressOffset>0x11f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.126</name>
        <addressOffset>0x11f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.127</name>
        <addressOffset>0x11fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.128</name>
        <addressOffset>0x1200</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.129</name>
        <addressOffset>0x1204</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.130</name>
        <addressOffset>0x1208</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.131</name>
        <addressOffset>0x120c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.132</name>
        <addressOffset>0x1210</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.133</name>
        <addressOffset>0x1214</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.134</name>
        <addressOffset>0x1218</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.135</name>
        <addressOffset>0x121c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.136</name>
        <addressOffset>0x1220</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.137</name>
        <addressOffset>0x1224</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.138</name>
        <addressOffset>0x1228</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.139</name>
        <addressOffset>0x122c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.140</name>
        <addressOffset>0x1230</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.141</name>
        <addressOffset>0x1234</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.142</name>
        <addressOffset>0x1238</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.143</name>
        <addressOffset>0x123c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.144</name>
        <addressOffset>0x1240</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.145</name>
        <addressOffset>0x1244</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.146</name>
        <addressOffset>0x1248</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.147</name>
        <addressOffset>0x124c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.148</name>
        <addressOffset>0x1250</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.149</name>
        <addressOffset>0x1254</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.150</name>
        <addressOffset>0x1258</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.151</name>
        <addressOffset>0x125c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.152</name>
        <addressOffset>0x1260</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.153</name>
        <addressOffset>0x1264</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.154</name>
        <addressOffset>0x1268</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.155</name>
        <addressOffset>0x126c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.156</name>
        <addressOffset>0x1270</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.157</name>
        <addressOffset>0x1274</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.158</name>
        <addressOffset>0x1278</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.159</name>
        <addressOffset>0x127c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.160</name>
        <addressOffset>0x1280</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.161</name>
        <addressOffset>0x1284</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.162</name>
        <addressOffset>0x1288</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.163</name>
        <addressOffset>0x128c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.164</name>
        <addressOffset>0x1290</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.165</name>
        <addressOffset>0x1294</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.166</name>
        <addressOffset>0x1298</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.167</name>
        <addressOffset>0x129c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.168</name>
        <addressOffset>0x12a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.169</name>
        <addressOffset>0x12a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.170</name>
        <addressOffset>0x12a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.171</name>
        <addressOffset>0x12ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.172</name>
        <addressOffset>0x12b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.173</name>
        <addressOffset>0x12b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.174</name>
        <addressOffset>0x12b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.175</name>
        <addressOffset>0x12bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.176</name>
        <addressOffset>0x12c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.177</name>
        <addressOffset>0x12c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.178</name>
        <addressOffset>0x12c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.179</name>
        <addressOffset>0x12cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.180</name>
        <addressOffset>0x12d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.181</name>
        <addressOffset>0x12d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.182</name>
        <addressOffset>0x12d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.183</name>
        <addressOffset>0x12dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.184</name>
        <addressOffset>0x12e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.185</name>
        <addressOffset>0x12e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.186</name>
        <addressOffset>0x12e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.187</name>
        <addressOffset>0x12ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.188</name>
        <addressOffset>0x12f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.189</name>
        <addressOffset>0x12f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.190</name>
        <addressOffset>0x12f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.191</name>
        <addressOffset>0x12fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.192</name>
        <addressOffset>0x1300</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.193</name>
        <addressOffset>0x1304</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.194</name>
        <addressOffset>0x1308</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.195</name>
        <addressOffset>0x130c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.196</name>
        <addressOffset>0x1310</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.197</name>
        <addressOffset>0x1314</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.198</name>
        <addressOffset>0x1318</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.199</name>
        <addressOffset>0x131c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.200</name>
        <addressOffset>0x1320</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.201</name>
        <addressOffset>0x1324</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.202</name>
        <addressOffset>0x1328</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.203</name>
        <addressOffset>0x132c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.204</name>
        <addressOffset>0x1330</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.205</name>
        <addressOffset>0x1334</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.206</name>
        <addressOffset>0x1338</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.207</name>
        <addressOffset>0x133c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.208</name>
        <addressOffset>0x1340</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.209</name>
        <addressOffset>0x1344</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.210</name>
        <addressOffset>0x1348</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.211</name>
        <addressOffset>0x134c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.212</name>
        <addressOffset>0x1350</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.213</name>
        <addressOffset>0x1354</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.214</name>
        <addressOffset>0x1358</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.215</name>
        <addressOffset>0x135c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.216</name>
        <addressOffset>0x1360</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.217</name>
        <addressOffset>0x1364</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.218</name>
        <addressOffset>0x1368</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.219</name>
        <addressOffset>0x136c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.220</name>
        <addressOffset>0x1370</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.221</name>
        <addressOffset>0x1374</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.222</name>
        <addressOffset>0x1378</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.223</name>
        <addressOffset>0x137c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.224</name>
        <addressOffset>0x1380</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.225</name>
        <addressOffset>0x1384</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.226</name>
        <addressOffset>0x1388</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.227</name>
        <addressOffset>0x138c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.228</name>
        <addressOffset>0x1390</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.229</name>
        <addressOffset>0x1394</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.230</name>
        <addressOffset>0x1398</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.231</name>
        <addressOffset>0x139c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.232</name>
        <addressOffset>0x13a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.233</name>
        <addressOffset>0x13a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.234</name>
        <addressOffset>0x13a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.235</name>
        <addressOffset>0x13ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.236</name>
        <addressOffset>0x13b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.237</name>
        <addressOffset>0x13b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.238</name>
        <addressOffset>0x13b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.239</name>
        <addressOffset>0x13bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.240</name>
        <addressOffset>0x13c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.241</name>
        <addressOffset>0x13c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.242</name>
        <addressOffset>0x13c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.243</name>
        <addressOffset>0x13cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.244</name>
        <addressOffset>0x13d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.245</name>
        <addressOffset>0x13d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.246</name>
        <addressOffset>0x13d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.247</name>
        <addressOffset>0x13dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.248</name>
        <addressOffset>0x13e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.249</name>
        <addressOffset>0x13e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.250</name>
        <addressOffset>0x13e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.251</name>
        <addressOffset>0x13ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.252</name>
        <addressOffset>0x13f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.253</name>
        <addressOffset>0x13f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.254</name>
        <addressOffset>0x13f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.255</name>
        <addressOffset>0x13fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.256</name>
        <addressOffset>0x1400</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.257</name>
        <addressOffset>0x1404</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.258</name>
        <addressOffset>0x1408</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.259</name>
        <addressOffset>0x140c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.260</name>
        <addressOffset>0x1410</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.261</name>
        <addressOffset>0x1414</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.262</name>
        <addressOffset>0x1418</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.263</name>
        <addressOffset>0x141c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.264</name>
        <addressOffset>0x1420</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.265</name>
        <addressOffset>0x1424</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.266</name>
        <addressOffset>0x1428</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.267</name>
        <addressOffset>0x142c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.268</name>
        <addressOffset>0x1430</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.269</name>
        <addressOffset>0x1434</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.270</name>
        <addressOffset>0x1438</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.271</name>
        <addressOffset>0x143c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.272</name>
        <addressOffset>0x1440</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.273</name>
        <addressOffset>0x1444</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.274</name>
        <addressOffset>0x1448</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.275</name>
        <addressOffset>0x144c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.276</name>
        <addressOffset>0x1450</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.277</name>
        <addressOffset>0x1454</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.278</name>
        <addressOffset>0x1458</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.279</name>
        <addressOffset>0x145c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.280</name>
        <addressOffset>0x1460</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.281</name>
        <addressOffset>0x1464</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.282</name>
        <addressOffset>0x1468</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.283</name>
        <addressOffset>0x146c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.284</name>
        <addressOffset>0x1470</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.285</name>
        <addressOffset>0x1474</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.286</name>
        <addressOffset>0x1478</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.287</name>
        <addressOffset>0x147c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.288</name>
        <addressOffset>0x1480</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.289</name>
        <addressOffset>0x1484</addressOffset>
        <size>0x20</size>
      </register>
