modm-ext/archive-stmicro-svd/header_stm32h7b3aii6q.svd
      <register>
        <name>LUT.466</name>
        <addressOffset>0x1748</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.467</name>
        <addressOffset>0x174c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.468</name>
        <addressOffset>0x1750</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.469</name>
        <addressOffset>0x1754</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.470</name>
        <addressOffset>0x1758</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.471</name>
        <addressOffset>0x175c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.472</name>
        <addressOffset>0x1760</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.473</name>
        <addressOffset>0x1764</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.474</name>
        <addressOffset>0x1768</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.475</name>
        <addressOffset>0x176c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.476</name>
        <addressOffset>0x1770</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.477</name>
        <addressOffset>0x1774</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.478</name>
        <addressOffset>0x1778</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.479</name>
        <addressOffset>0x177c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.480</name>
        <addressOffset>0x1780</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.481</name>
        <addressOffset>0x1784</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.482</name>
        <addressOffset>0x1788</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.483</name>
        <addressOffset>0x178c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.484</name>
        <addressOffset>0x1790</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.485</name>
        <addressOffset>0x1794</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.486</name>
        <addressOffset>0x1798</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.487</name>
        <addressOffset>0x179c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.488</name>
        <addressOffset>0x17a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.489</name>
        <addressOffset>0x17a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.490</name>
        <addressOffset>0x17a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.491</name>
        <addressOffset>0x17ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.492</name>
        <addressOffset>0x17b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.493</name>
        <addressOffset>0x17b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.494</name>
        <addressOffset>0x17b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.495</name>
        <addressOffset>0x17bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.496</name>
        <addressOffset>0x17c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.497</name>
        <addressOffset>0x17c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.498</name>
        <addressOffset>0x17c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.499</name>
        <addressOffset>0x17cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.500</name>
        <addressOffset>0x17d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.501</name>
        <addressOffset>0x17d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.502</name>
        <addressOffset>0x17d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.503</name>
        <addressOffset>0x17dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.504</name>
        <addressOffset>0x17e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.505</name>
        <addressOffset>0x17e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.506</name>
        <addressOffset>0x17e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.507</name>
        <addressOffset>0x17ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.508</name>
        <addressOffset>0x17f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.509</name>
        <addressOffset>0x17f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.510</name>
        <addressOffset>0x17f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.511</name>
        <addressOffset>0x17fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.512</name>
        <addressOffset>0x1800</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.513</name>
        <addressOffset>0x1804</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.514</name>
        <addressOffset>0x1808</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.515</name>
        <addressOffset>0x180c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.516</name>
        <addressOffset>0x1810</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.517</name>
        <addressOffset>0x1814</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.518</name>
        <addressOffset>0x1818</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.519</name>
        <addressOffset>0x181c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.520</name>
        <addressOffset>0x1820</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.521</name>
        <addressOffset>0x1824</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.522</name>
        <addressOffset>0x1828</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.523</name>
        <addressOffset>0x182c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.524</name>
        <addressOffset>0x1830</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.525</name>
        <addressOffset>0x1834</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.526</name>
        <addressOffset>0x1838</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.527</name>
        <addressOffset>0x183c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.528</name>
        <addressOffset>0x1840</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.529</name>
        <addressOffset>0x1844</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.530</name>
        <addressOffset>0x1848</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.531</name>
        <addressOffset>0x184c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.532</name>
        <addressOffset>0x1850</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.533</name>
        <addressOffset>0x1854</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.534</name>
        <addressOffset>0x1858</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.535</name>
        <addressOffset>0x185c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.536</name>
        <addressOffset>0x1860</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.537</name>
        <addressOffset>0x1864</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.538</name>
        <addressOffset>0x1868</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.539</name>
        <addressOffset>0x186c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.540</name>
        <addressOffset>0x1870</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.541</name>
        <addressOffset>0x1874</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.542</name>
        <addressOffset>0x1878</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.543</name>
        <addressOffset>0x187c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.544</name>
        <addressOffset>0x1880</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.545</name>
        <addressOffset>0x1884</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.546</name>
        <addressOffset>0x1888</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.547</name>
        <addressOffset>0x188c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.548</name>
        <addressOffset>0x1890</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.549</name>
        <addressOffset>0x1894</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.550</name>
        <addressOffset>0x1898</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.551</name>
        <addressOffset>0x189c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.552</name>
        <addressOffset>0x18a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.553</name>
        <addressOffset>0x18a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.554</name>
        <addressOffset>0x18a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.555</name>
        <addressOffset>0x18ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.556</name>
        <addressOffset>0x18b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.557</name>
        <addressOffset>0x18b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.558</name>
        <addressOffset>0x18b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.559</name>
        <addressOffset>0x18bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.560</name>
        <addressOffset>0x18c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.561</name>
        <addressOffset>0x18c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.562</name>
        <addressOffset>0x18c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.563</name>
        <addressOffset>0x18cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.564</name>
        <addressOffset>0x18d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.565</name>
        <addressOffset>0x18d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.566</name>
        <addressOffset>0x18d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.567</name>
        <addressOffset>0x18dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.568</name>
        <addressOffset>0x18e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.569</name>
        <addressOffset>0x18e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.570</name>
        <addressOffset>0x18e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.571</name>
        <addressOffset>0x18ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.572</name>
        <addressOffset>0x18f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.573</name>
        <addressOffset>0x18f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.574</name>
        <addressOffset>0x18f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.575</name>
        <addressOffset>0x18fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.576</name>
        <addressOffset>0x1900</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.577</name>
        <addressOffset>0x1904</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.578</name>
        <addressOffset>0x1908</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.579</name>
        <addressOffset>0x190c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.580</name>
        <addressOffset>0x1910</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.581</name>
        <addressOffset>0x1914</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.582</name>
        <addressOffset>0x1918</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.583</name>
        <addressOffset>0x191c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.584</name>
        <addressOffset>0x1920</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.585</name>
        <addressOffset>0x1924</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.586</name>
        <addressOffset>0x1928</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.587</name>
        <addressOffset>0x192c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.588</name>
        <addressOffset>0x1930</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.589</name>
        <addressOffset>0x1934</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.590</name>
        <addressOffset>0x1938</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.591</name>
        <addressOffset>0x193c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.592</name>
        <addressOffset>0x1940</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.593</name>
        <addressOffset>0x1944</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.594</name>
        <addressOffset>0x1948</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.595</name>
        <addressOffset>0x194c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.596</name>
        <addressOffset>0x1950</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.597</name>
        <addressOffset>0x1954</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.598</name>
        <addressOffset>0x1958</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.599</name>
        <addressOffset>0x195c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.600</name>
        <addressOffset>0x1960</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.601</name>
        <addressOffset>0x1964</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.602</name>
        <addressOffset>0x1968</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.603</name>
        <addressOffset>0x196c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.604</name>
        <addressOffset>0x1970</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.605</name>
        <addressOffset>0x1974</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.606</name>
        <addressOffset>0x1978</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.607</name>
        <addressOffset>0x197c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.608</name>
        <addressOffset>0x1980</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.609</name>
        <addressOffset>0x1984</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.610</name>
        <addressOffset>0x1988</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.611</name>
        <addressOffset>0x198c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.612</name>
        <addressOffset>0x1990</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.613</name>
        <addressOffset>0x1994</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.614</name>
        <addressOffset>0x1998</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.615</name>
        <addressOffset>0x199c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.616</name>
        <addressOffset>0x19a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.617</name>
        <addressOffset>0x19a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.618</name>
        <addressOffset>0x19a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.619</name>
        <addressOffset>0x19ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.620</name>
        <addressOffset>0x19b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.621</name>
        <addressOffset>0x19b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.622</name>
        <addressOffset>0x19b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.623</name>
        <addressOffset>0x19bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.624</name>
        <addressOffset>0x19c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.625</name>
        <addressOffset>0x19c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.626</name>
        <addressOffset>0x19c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.627</name>
        <addressOffset>0x19cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.628</name>
        <addressOffset>0x19d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.629</name>
        <addressOffset>0x19d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.630</name>
        <addressOffset>0x19d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.631</name>
        <addressOffset>0x19dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.632</name>
        <addressOffset>0x19e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.633</name>
        <addressOffset>0x19e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.634</name>
        <addressOffset>0x19e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.635</name>
        <addressOffset>0x19ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.636</name>
        <addressOffset>0x19f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.637</name>
        <addressOffset>0x19f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.638</name>
        <addressOffset>0x19f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.639</name>
        <addressOffset>0x19fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.640</name>
        <addressOffset>0x1a00</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.641</name>
        <addressOffset>0x1a04</addressOffset>
        <size>0x20</size>
      </register>
