modm-ext/archive-stmicro-svd/header_stm32h7b3aii6q.svd
      <register>
        <name>LUT.994</name>
        <addressOffset>0x1f88</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.995</name>
        <addressOffset>0x1f8c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.996</name>
        <addressOffset>0x1f90</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.997</name>
        <addressOffset>0x1f94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.998</name>
        <addressOffset>0x1f98</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.999</name>
        <addressOffset>0x1f9c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1000</name>
        <addressOffset>0x1fa0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1001</name>
        <addressOffset>0x1fa4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1002</name>
        <addressOffset>0x1fa8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1003</name>
        <addressOffset>0x1fac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1004</name>
        <addressOffset>0x1fb0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1005</name>
        <addressOffset>0x1fb4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1006</name>
        <addressOffset>0x1fb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1007</name>
        <addressOffset>0x1fbc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1008</name>
        <addressOffset>0x1fc0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1009</name>
        <addressOffset>0x1fc4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1010</name>
        <addressOffset>0x1fc8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1011</name>
        <addressOffset>0x1fcc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1012</name>
        <addressOffset>0x1fd0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1013</name>
        <addressOffset>0x1fd4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1014</name>
        <addressOffset>0x1fd8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1015</name>
        <addressOffset>0x1fdc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1016</name>
        <addressOffset>0x1fe0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1017</name>
        <addressOffset>0x1fe4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1018</name>
        <addressOffset>0x1fe8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1019</name>
        <addressOffset>0x1fec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1020</name>
        <addressOffset>0x1ff0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1021</name>
        <addressOffset>0x1ff4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1022</name>
        <addressOffset>0x1ff8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1023</name>
        <addressOffset>0x1ffc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1024</name>
        <addressOffset>0x2000</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1025</name>
        <addressOffset>0x2004</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1026</name>
        <addressOffset>0x2008</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1027</name>
        <addressOffset>0x200c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1028</name>
        <addressOffset>0x2010</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1029</name>
        <addressOffset>0x2014</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1030</name>
        <addressOffset>0x2018</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1031</name>
        <addressOffset>0x201c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1032</name>
        <addressOffset>0x2020</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1033</name>
        <addressOffset>0x2024</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1034</name>
        <addressOffset>0x2028</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1035</name>
        <addressOffset>0x202c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1036</name>
        <addressOffset>0x2030</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1037</name>
        <addressOffset>0x2034</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1038</name>
        <addressOffset>0x2038</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1039</name>
        <addressOffset>0x203c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1040</name>
        <addressOffset>0x2040</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1041</name>
        <addressOffset>0x2044</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1042</name>
        <addressOffset>0x2048</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1043</name>
        <addressOffset>0x204c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1044</name>
        <addressOffset>0x2050</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1045</name>
        <addressOffset>0x2054</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1046</name>
        <addressOffset>0x2058</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1047</name>
        <addressOffset>0x205c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1048</name>
        <addressOffset>0x2060</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1049</name>
        <addressOffset>0x2064</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1050</name>
        <addressOffset>0x2068</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1051</name>
        <addressOffset>0x206c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1052</name>
        <addressOffset>0x2070</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1053</name>
        <addressOffset>0x2074</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1054</name>
        <addressOffset>0x2078</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1055</name>
        <addressOffset>0x207c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1056</name>
        <addressOffset>0x2080</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1057</name>
        <addressOffset>0x2084</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1058</name>
        <addressOffset>0x2088</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1059</name>
        <addressOffset>0x208c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1060</name>
        <addressOffset>0x2090</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1061</name>
        <addressOffset>0x2094</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1062</name>
        <addressOffset>0x2098</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1063</name>
        <addressOffset>0x209c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1064</name>
        <addressOffset>0x20a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1065</name>
        <addressOffset>0x20a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1066</name>
        <addressOffset>0x20a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1067</name>
        <addressOffset>0x20ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1068</name>
        <addressOffset>0x20b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1069</name>
        <addressOffset>0x20b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1070</name>
        <addressOffset>0x20b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1071</name>
        <addressOffset>0x20bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1072</name>
        <addressOffset>0x20c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1073</name>
        <addressOffset>0x20c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1074</name>
        <addressOffset>0x20c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1075</name>
        <addressOffset>0x20cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1076</name>
        <addressOffset>0x20d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1077</name>
        <addressOffset>0x20d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1078</name>
        <addressOffset>0x20d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1079</name>
        <addressOffset>0x20dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1080</name>
        <addressOffset>0x20e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1081</name>
        <addressOffset>0x20e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1082</name>
        <addressOffset>0x20e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1083</name>
        <addressOffset>0x20ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1084</name>
        <addressOffset>0x20f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1085</name>
        <addressOffset>0x20f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1086</name>
        <addressOffset>0x20f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1087</name>
        <addressOffset>0x20fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1088</name>
        <addressOffset>0x2100</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1089</name>
        <addressOffset>0x2104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1090</name>
        <addressOffset>0x2108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1091</name>
        <addressOffset>0x210c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1092</name>
        <addressOffset>0x2110</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1093</name>
        <addressOffset>0x2114</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1094</name>
        <addressOffset>0x2118</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1095</name>
        <addressOffset>0x211c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1096</name>
        <addressOffset>0x2120</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1097</name>
        <addressOffset>0x2124</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1098</name>
        <addressOffset>0x2128</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1099</name>
        <addressOffset>0x212c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1100</name>
        <addressOffset>0x2130</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1101</name>
        <addressOffset>0x2134</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1102</name>
        <addressOffset>0x2138</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1103</name>
        <addressOffset>0x213c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1104</name>
        <addressOffset>0x2140</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1105</name>
        <addressOffset>0x2144</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1106</name>
        <addressOffset>0x2148</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1107</name>
        <addressOffset>0x214c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1108</name>
        <addressOffset>0x2150</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1109</name>
        <addressOffset>0x2154</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1110</name>
        <addressOffset>0x2158</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1111</name>
        <addressOffset>0x215c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1112</name>
        <addressOffset>0x2160</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1113</name>
        <addressOffset>0x2164</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1114</name>
        <addressOffset>0x2168</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1115</name>
        <addressOffset>0x216c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1116</name>
        <addressOffset>0x2170</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1117</name>
        <addressOffset>0x2174</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1118</name>
        <addressOffset>0x2178</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1119</name>
        <addressOffset>0x217c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1120</name>
        <addressOffset>0x2180</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1121</name>
        <addressOffset>0x2184</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1122</name>
        <addressOffset>0x2188</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1123</name>
        <addressOffset>0x218c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1124</name>
        <addressOffset>0x2190</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1125</name>
        <addressOffset>0x2194</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1126</name>
        <addressOffset>0x2198</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1127</name>
        <addressOffset>0x219c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1128</name>
        <addressOffset>0x21a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1129</name>
        <addressOffset>0x21a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1130</name>
        <addressOffset>0x21a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1131</name>
        <addressOffset>0x21ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1132</name>
        <addressOffset>0x21b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1133</name>
        <addressOffset>0x21b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1134</name>
        <addressOffset>0x21b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1135</name>
        <addressOffset>0x21bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1136</name>
        <addressOffset>0x21c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1137</name>
        <addressOffset>0x21c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1138</name>
        <addressOffset>0x21c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1139</name>
        <addressOffset>0x21cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1140</name>
        <addressOffset>0x21d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1141</name>
        <addressOffset>0x21d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1142</name>
        <addressOffset>0x21d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1143</name>
        <addressOffset>0x21dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1144</name>
        <addressOffset>0x21e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1145</name>
        <addressOffset>0x21e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1146</name>
        <addressOffset>0x21e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1147</name>
        <addressOffset>0x21ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1148</name>
        <addressOffset>0x21f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1149</name>
        <addressOffset>0x21f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1150</name>
        <addressOffset>0x21f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1151</name>
        <addressOffset>0x21fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1152</name>
        <addressOffset>0x2200</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1153</name>
        <addressOffset>0x2204</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1154</name>
        <addressOffset>0x2208</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1155</name>
        <addressOffset>0x220c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1156</name>
        <addressOffset>0x2210</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1157</name>
        <addressOffset>0x2214</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1158</name>
        <addressOffset>0x2218</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1159</name>
        <addressOffset>0x221c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1160</name>
        <addressOffset>0x2220</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1161</name>
        <addressOffset>0x2224</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1162</name>
        <addressOffset>0x2228</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1163</name>
        <addressOffset>0x222c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1164</name>
        <addressOffset>0x2230</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1165</name>
        <addressOffset>0x2234</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1166</name>
        <addressOffset>0x2238</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1167</name>
        <addressOffset>0x223c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1168</name>
        <addressOffset>0x2240</addressOffset>
        <size>0x20</size>
      </register>
