modm-ext/archive-stmicro-svd/header_stm32h7b3aii6q.svd
      <register>
        <name>LUT.1344</name>
        <addressOffset>0x2500</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1345</name>
        <addressOffset>0x2504</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1346</name>
        <addressOffset>0x2508</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1347</name>
        <addressOffset>0x250c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1348</name>
        <addressOffset>0x2510</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1349</name>
        <addressOffset>0x2514</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1350</name>
        <addressOffset>0x2518</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1351</name>
        <addressOffset>0x251c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1352</name>
        <addressOffset>0x2520</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1353</name>
        <addressOffset>0x2524</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1354</name>
        <addressOffset>0x2528</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1355</name>
        <addressOffset>0x252c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1356</name>
        <addressOffset>0x2530</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1357</name>
        <addressOffset>0x2534</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1358</name>
        <addressOffset>0x2538</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1359</name>
        <addressOffset>0x253c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1360</name>
        <addressOffset>0x2540</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1361</name>
        <addressOffset>0x2544</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1362</name>
        <addressOffset>0x2548</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1363</name>
        <addressOffset>0x254c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1364</name>
        <addressOffset>0x2550</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1365</name>
        <addressOffset>0x2554</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1366</name>
        <addressOffset>0x2558</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1367</name>
        <addressOffset>0x255c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1368</name>
        <addressOffset>0x2560</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1369</name>
        <addressOffset>0x2564</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1370</name>
        <addressOffset>0x2568</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1371</name>
        <addressOffset>0x256c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1372</name>
        <addressOffset>0x2570</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1373</name>
        <addressOffset>0x2574</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1374</name>
        <addressOffset>0x2578</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1375</name>
        <addressOffset>0x257c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1376</name>
        <addressOffset>0x2580</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1377</name>
        <addressOffset>0x2584</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1378</name>
        <addressOffset>0x2588</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1379</name>
        <addressOffset>0x258c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1380</name>
        <addressOffset>0x2590</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1381</name>
        <addressOffset>0x2594</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1382</name>
        <addressOffset>0x2598</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1383</name>
        <addressOffset>0x259c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1384</name>
        <addressOffset>0x25a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1385</name>
        <addressOffset>0x25a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1386</name>
        <addressOffset>0x25a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1387</name>
        <addressOffset>0x25ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1388</name>
        <addressOffset>0x25b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1389</name>
        <addressOffset>0x25b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1390</name>
        <addressOffset>0x25b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1391</name>
        <addressOffset>0x25bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1392</name>
        <addressOffset>0x25c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1393</name>
        <addressOffset>0x25c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1394</name>
        <addressOffset>0x25c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1395</name>
        <addressOffset>0x25cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1396</name>
        <addressOffset>0x25d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1397</name>
        <addressOffset>0x25d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1398</name>
        <addressOffset>0x25d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1399</name>
        <addressOffset>0x25dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1400</name>
        <addressOffset>0x25e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1401</name>
        <addressOffset>0x25e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1402</name>
        <addressOffset>0x25e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1403</name>
        <addressOffset>0x25ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1404</name>
        <addressOffset>0x25f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1405</name>
        <addressOffset>0x25f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1406</name>
        <addressOffset>0x25f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1407</name>
        <addressOffset>0x25fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1408</name>
        <addressOffset>0x2600</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1409</name>
        <addressOffset>0x2604</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1410</name>
        <addressOffset>0x2608</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1411</name>
        <addressOffset>0x260c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1412</name>
        <addressOffset>0x2610</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1413</name>
        <addressOffset>0x2614</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1414</name>
        <addressOffset>0x2618</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1415</name>
        <addressOffset>0x261c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1416</name>
        <addressOffset>0x2620</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1417</name>
        <addressOffset>0x2624</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1418</name>
        <addressOffset>0x2628</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1419</name>
        <addressOffset>0x262c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1420</name>
        <addressOffset>0x2630</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1421</name>
        <addressOffset>0x2634</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1422</name>
        <addressOffset>0x2638</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1423</name>
        <addressOffset>0x263c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1424</name>
        <addressOffset>0x2640</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1425</name>
        <addressOffset>0x2644</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1426</name>
        <addressOffset>0x2648</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1427</name>
        <addressOffset>0x264c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1428</name>
        <addressOffset>0x2650</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1429</name>
        <addressOffset>0x2654</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1430</name>
        <addressOffset>0x2658</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1431</name>
        <addressOffset>0x265c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1432</name>
        <addressOffset>0x2660</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1433</name>
        <addressOffset>0x2664</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1434</name>
        <addressOffset>0x2668</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1435</name>
        <addressOffset>0x266c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1436</name>
        <addressOffset>0x2670</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1437</name>
        <addressOffset>0x2674</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1438</name>
        <addressOffset>0x2678</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1439</name>
        <addressOffset>0x267c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1440</name>
        <addressOffset>0x2680</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1441</name>
        <addressOffset>0x2684</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1442</name>
        <addressOffset>0x2688</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1443</name>
        <addressOffset>0x268c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1444</name>
        <addressOffset>0x2690</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1445</name>
        <addressOffset>0x2694</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1446</name>
        <addressOffset>0x2698</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1447</name>
        <addressOffset>0x269c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1448</name>
        <addressOffset>0x26a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1449</name>
        <addressOffset>0x26a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1450</name>
        <addressOffset>0x26a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1451</name>
        <addressOffset>0x26ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1452</name>
        <addressOffset>0x26b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1453</name>
        <addressOffset>0x26b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1454</name>
        <addressOffset>0x26b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1455</name>
        <addressOffset>0x26bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1456</name>
        <addressOffset>0x26c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1457</name>
        <addressOffset>0x26c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1458</name>
        <addressOffset>0x26c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1459</name>
        <addressOffset>0x26cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1460</name>
        <addressOffset>0x26d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1461</name>
        <addressOffset>0x26d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1462</name>
        <addressOffset>0x26d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1463</name>
        <addressOffset>0x26dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1464</name>
        <addressOffset>0x26e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1465</name>
        <addressOffset>0x26e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1466</name>
        <addressOffset>0x26e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1467</name>
        <addressOffset>0x26ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1468</name>
        <addressOffset>0x26f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1469</name>
        <addressOffset>0x26f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1470</name>
        <addressOffset>0x26f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1471</name>
        <addressOffset>0x26fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1472</name>
        <addressOffset>0x2700</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1473</name>
        <addressOffset>0x2704</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1474</name>
        <addressOffset>0x2708</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1475</name>
        <addressOffset>0x270c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1476</name>
        <addressOffset>0x2710</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1477</name>
        <addressOffset>0x2714</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1478</name>
        <addressOffset>0x2718</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1479</name>
        <addressOffset>0x271c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1480</name>
        <addressOffset>0x2720</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1481</name>
        <addressOffset>0x2724</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1482</name>
        <addressOffset>0x2728</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1483</name>
        <addressOffset>0x272c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1484</name>
        <addressOffset>0x2730</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1485</name>
        <addressOffset>0x2734</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1486</name>
        <addressOffset>0x2738</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1487</name>
        <addressOffset>0x273c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1488</name>
        <addressOffset>0x2740</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1489</name>
        <addressOffset>0x2744</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1490</name>
        <addressOffset>0x2748</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1491</name>
        <addressOffset>0x274c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1492</name>
        <addressOffset>0x2750</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1493</name>
        <addressOffset>0x2754</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1494</name>
        <addressOffset>0x2758</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1495</name>
        <addressOffset>0x275c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1496</name>
        <addressOffset>0x2760</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1497</name>
        <addressOffset>0x2764</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1498</name>
        <addressOffset>0x2768</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1499</name>
        <addressOffset>0x276c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1500</name>
        <addressOffset>0x2770</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1501</name>
        <addressOffset>0x2774</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1502</name>
        <addressOffset>0x2778</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1503</name>
        <addressOffset>0x277c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1504</name>
        <addressOffset>0x2780</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1505</name>
        <addressOffset>0x2784</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1506</name>
        <addressOffset>0x2788</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1507</name>
        <addressOffset>0x278c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1508</name>
        <addressOffset>0x2790</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1509</name>
        <addressOffset>0x2794</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1510</name>
        <addressOffset>0x2798</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1511</name>
        <addressOffset>0x279c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1512</name>
        <addressOffset>0x27a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1513</name>
        <addressOffset>0x27a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1514</name>
        <addressOffset>0x27a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1515</name>
        <addressOffset>0x27ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1516</name>
        <addressOffset>0x27b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1517</name>
        <addressOffset>0x27b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1518</name>
        <addressOffset>0x27b8</addressOffset>
        <size>0x20</size>
      </register>
