modm-ext/archive-stmicro-svd/header_stm32h7b3aii6q.svd
      <register>
        <name>LUT.1519</name>
        <addressOffset>0x27bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1520</name>
        <addressOffset>0x27c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1521</name>
        <addressOffset>0x27c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1522</name>
        <addressOffset>0x27c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1523</name>
        <addressOffset>0x27cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1524</name>
        <addressOffset>0x27d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1525</name>
        <addressOffset>0x27d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1526</name>
        <addressOffset>0x27d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1527</name>
        <addressOffset>0x27dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1528</name>
        <addressOffset>0x27e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1529</name>
        <addressOffset>0x27e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1530</name>
        <addressOffset>0x27e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1531</name>
        <addressOffset>0x27ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1532</name>
        <addressOffset>0x27f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1533</name>
        <addressOffset>0x27f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1534</name>
        <addressOffset>0x27f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1535</name>
        <addressOffset>0x27fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1536</name>
        <addressOffset>0x2800</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1537</name>
        <addressOffset>0x2804</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1538</name>
        <addressOffset>0x2808</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1539</name>
        <addressOffset>0x280c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1540</name>
        <addressOffset>0x2810</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1541</name>
        <addressOffset>0x2814</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1542</name>
        <addressOffset>0x2818</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1543</name>
        <addressOffset>0x281c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1544</name>
        <addressOffset>0x2820</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1545</name>
        <addressOffset>0x2824</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1546</name>
        <addressOffset>0x2828</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1547</name>
        <addressOffset>0x282c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1548</name>
        <addressOffset>0x2830</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1549</name>
        <addressOffset>0x2834</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1550</name>
        <addressOffset>0x2838</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1551</name>
        <addressOffset>0x283c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1552</name>
        <addressOffset>0x2840</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1553</name>
        <addressOffset>0x2844</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1554</name>
        <addressOffset>0x2848</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1555</name>
        <addressOffset>0x284c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1556</name>
        <addressOffset>0x2850</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1557</name>
        <addressOffset>0x2854</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1558</name>
        <addressOffset>0x2858</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1559</name>
        <addressOffset>0x285c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1560</name>
        <addressOffset>0x2860</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1561</name>
        <addressOffset>0x2864</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1562</name>
        <addressOffset>0x2868</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1563</name>
        <addressOffset>0x286c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1564</name>
        <addressOffset>0x2870</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1565</name>
        <addressOffset>0x2874</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1566</name>
        <addressOffset>0x2878</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1567</name>
        <addressOffset>0x287c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1568</name>
        <addressOffset>0x2880</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1569</name>
        <addressOffset>0x2884</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1570</name>
        <addressOffset>0x2888</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1571</name>
        <addressOffset>0x288c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1572</name>
        <addressOffset>0x2890</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1573</name>
        <addressOffset>0x2894</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1574</name>
        <addressOffset>0x2898</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1575</name>
        <addressOffset>0x289c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1576</name>
        <addressOffset>0x28a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1577</name>
        <addressOffset>0x28a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1578</name>
        <addressOffset>0x28a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1579</name>
        <addressOffset>0x28ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1580</name>
        <addressOffset>0x28b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1581</name>
        <addressOffset>0x28b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1582</name>
        <addressOffset>0x28b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1583</name>
        <addressOffset>0x28bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1584</name>
        <addressOffset>0x28c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1585</name>
        <addressOffset>0x28c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1586</name>
        <addressOffset>0x28c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1587</name>
        <addressOffset>0x28cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1588</name>
        <addressOffset>0x28d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1589</name>
        <addressOffset>0x28d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1590</name>
        <addressOffset>0x28d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1591</name>
        <addressOffset>0x28dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1592</name>
        <addressOffset>0x28e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1593</name>
        <addressOffset>0x28e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1594</name>
        <addressOffset>0x28e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1595</name>
        <addressOffset>0x28ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1596</name>
        <addressOffset>0x28f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1597</name>
        <addressOffset>0x28f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1598</name>
        <addressOffset>0x28f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1599</name>
        <addressOffset>0x28fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1600</name>
        <addressOffset>0x2900</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1601</name>
        <addressOffset>0x2904</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1602</name>
        <addressOffset>0x2908</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1603</name>
        <addressOffset>0x290c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1604</name>
        <addressOffset>0x2910</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1605</name>
        <addressOffset>0x2914</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1606</name>
        <addressOffset>0x2918</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1607</name>
        <addressOffset>0x291c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1608</name>
        <addressOffset>0x2920</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1609</name>
        <addressOffset>0x2924</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1610</name>
        <addressOffset>0x2928</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1611</name>
        <addressOffset>0x292c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1612</name>
        <addressOffset>0x2930</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1613</name>
        <addressOffset>0x2934</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1614</name>
        <addressOffset>0x2938</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1615</name>
        <addressOffset>0x293c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1616</name>
        <addressOffset>0x2940</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1617</name>
        <addressOffset>0x2944</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1618</name>
        <addressOffset>0x2948</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1619</name>
        <addressOffset>0x294c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1620</name>
        <addressOffset>0x2950</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1621</name>
        <addressOffset>0x2954</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1622</name>
        <addressOffset>0x2958</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1623</name>
        <addressOffset>0x295c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1624</name>
        <addressOffset>0x2960</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1625</name>
        <addressOffset>0x2964</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1626</name>
        <addressOffset>0x2968</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1627</name>
        <addressOffset>0x296c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1628</name>
        <addressOffset>0x2970</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1629</name>
        <addressOffset>0x2974</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1630</name>
        <addressOffset>0x2978</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1631</name>
        <addressOffset>0x297c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1632</name>
        <addressOffset>0x2980</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1633</name>
        <addressOffset>0x2984</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1634</name>
        <addressOffset>0x2988</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1635</name>
        <addressOffset>0x298c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1636</name>
        <addressOffset>0x2990</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1637</name>
        <addressOffset>0x2994</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1638</name>
        <addressOffset>0x2998</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1639</name>
        <addressOffset>0x299c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1640</name>
        <addressOffset>0x29a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1641</name>
        <addressOffset>0x29a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1642</name>
        <addressOffset>0x29a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1643</name>
        <addressOffset>0x29ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1644</name>
        <addressOffset>0x29b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1645</name>
        <addressOffset>0x29b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1646</name>
        <addressOffset>0x29b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1647</name>
        <addressOffset>0x29bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1648</name>
        <addressOffset>0x29c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1649</name>
        <addressOffset>0x29c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1650</name>
        <addressOffset>0x29c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1651</name>
        <addressOffset>0x29cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1652</name>
        <addressOffset>0x29d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1653</name>
        <addressOffset>0x29d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1654</name>
        <addressOffset>0x29d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1655</name>
        <addressOffset>0x29dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1656</name>
        <addressOffset>0x29e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1657</name>
        <addressOffset>0x29e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1658</name>
        <addressOffset>0x29e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1659</name>
        <addressOffset>0x29ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1660</name>
        <addressOffset>0x29f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1661</name>
        <addressOffset>0x29f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1662</name>
        <addressOffset>0x29f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1663</name>
        <addressOffset>0x29fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1664</name>
        <addressOffset>0x2a00</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1665</name>
        <addressOffset>0x2a04</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1666</name>
        <addressOffset>0x2a08</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1667</name>
        <addressOffset>0x2a0c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1668</name>
        <addressOffset>0x2a10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1669</name>
        <addressOffset>0x2a14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1670</name>
        <addressOffset>0x2a18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1671</name>
        <addressOffset>0x2a1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1672</name>
        <addressOffset>0x2a20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1673</name>
        <addressOffset>0x2a24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1674</name>
        <addressOffset>0x2a28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1675</name>
        <addressOffset>0x2a2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1676</name>
        <addressOffset>0x2a30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1677</name>
        <addressOffset>0x2a34</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1678</name>
        <addressOffset>0x2a38</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1679</name>
        <addressOffset>0x2a3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1680</name>
        <addressOffset>0x2a40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1681</name>
        <addressOffset>0x2a44</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1682</name>
        <addressOffset>0x2a48</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1683</name>
        <addressOffset>0x2a4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1684</name>
        <addressOffset>0x2a50</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1685</name>
        <addressOffset>0x2a54</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1686</name>
        <addressOffset>0x2a58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1687</name>
        <addressOffset>0x2a5c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1688</name>
        <addressOffset>0x2a60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1689</name>
        <addressOffset>0x2a64</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1690</name>
        <addressOffset>0x2a68</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1691</name>
        <addressOffset>0x2a6c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1692</name>
        <addressOffset>0x2a70</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1693</name>
        <addressOffset>0x2a74</addressOffset>
        <size>0x20</size>
      </register>
