modm-ext/archive-stmicro-svd/header_stm32h7b3aii6q.svd
      <register>
        <name>LUT.1694</name>
        <addressOffset>0x2a78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1695</name>
        <addressOffset>0x2a7c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1696</name>
        <addressOffset>0x2a80</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1697</name>
        <addressOffset>0x2a84</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1698</name>
        <addressOffset>0x2a88</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1699</name>
        <addressOffset>0x2a8c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1700</name>
        <addressOffset>0x2a90</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1701</name>
        <addressOffset>0x2a94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1702</name>
        <addressOffset>0x2a98</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1703</name>
        <addressOffset>0x2a9c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1704</name>
        <addressOffset>0x2aa0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1705</name>
        <addressOffset>0x2aa4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1706</name>
        <addressOffset>0x2aa8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1707</name>
        <addressOffset>0x2aac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1708</name>
        <addressOffset>0x2ab0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1709</name>
        <addressOffset>0x2ab4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1710</name>
        <addressOffset>0x2ab8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1711</name>
        <addressOffset>0x2abc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1712</name>
        <addressOffset>0x2ac0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1713</name>
        <addressOffset>0x2ac4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1714</name>
        <addressOffset>0x2ac8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1715</name>
        <addressOffset>0x2acc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1716</name>
        <addressOffset>0x2ad0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1717</name>
        <addressOffset>0x2ad4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1718</name>
        <addressOffset>0x2ad8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1719</name>
        <addressOffset>0x2adc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1720</name>
        <addressOffset>0x2ae0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1721</name>
        <addressOffset>0x2ae4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1722</name>
        <addressOffset>0x2ae8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1723</name>
        <addressOffset>0x2aec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1724</name>
        <addressOffset>0x2af0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1725</name>
        <addressOffset>0x2af4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1726</name>
        <addressOffset>0x2af8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1727</name>
        <addressOffset>0x2afc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1728</name>
        <addressOffset>0x2b00</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1729</name>
        <addressOffset>0x2b04</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1730</name>
        <addressOffset>0x2b08</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1731</name>
        <addressOffset>0x2b0c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1732</name>
        <addressOffset>0x2b10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1733</name>
        <addressOffset>0x2b14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1734</name>
        <addressOffset>0x2b18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1735</name>
        <addressOffset>0x2b1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1736</name>
        <addressOffset>0x2b20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1737</name>
        <addressOffset>0x2b24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1738</name>
        <addressOffset>0x2b28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1739</name>
        <addressOffset>0x2b2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1740</name>
        <addressOffset>0x2b30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1741</name>
        <addressOffset>0x2b34</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1742</name>
        <addressOffset>0x2b38</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1743</name>
        <addressOffset>0x2b3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1744</name>
        <addressOffset>0x2b40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1745</name>
        <addressOffset>0x2b44</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1746</name>
        <addressOffset>0x2b48</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1747</name>
        <addressOffset>0x2b4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1748</name>
        <addressOffset>0x2b50</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1749</name>
        <addressOffset>0x2b54</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1750</name>
        <addressOffset>0x2b58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1751</name>
        <addressOffset>0x2b5c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1752</name>
        <addressOffset>0x2b60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1753</name>
        <addressOffset>0x2b64</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1754</name>
        <addressOffset>0x2b68</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1755</name>
        <addressOffset>0x2b6c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1756</name>
        <addressOffset>0x2b70</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1757</name>
        <addressOffset>0x2b74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1758</name>
        <addressOffset>0x2b78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1759</name>
        <addressOffset>0x2b7c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1760</name>
        <addressOffset>0x2b80</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1761</name>
        <addressOffset>0x2b84</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1762</name>
        <addressOffset>0x2b88</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1763</name>
        <addressOffset>0x2b8c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1764</name>
        <addressOffset>0x2b90</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1765</name>
        <addressOffset>0x2b94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1766</name>
        <addressOffset>0x2b98</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1767</name>
        <addressOffset>0x2b9c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1768</name>
        <addressOffset>0x2ba0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1769</name>
        <addressOffset>0x2ba4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1770</name>
        <addressOffset>0x2ba8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1771</name>
        <addressOffset>0x2bac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1772</name>
        <addressOffset>0x2bb0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1773</name>
        <addressOffset>0x2bb4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1774</name>
        <addressOffset>0x2bb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1775</name>
        <addressOffset>0x2bbc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1776</name>
        <addressOffset>0x2bc0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1777</name>
        <addressOffset>0x2bc4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1778</name>
        <addressOffset>0x2bc8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1779</name>
        <addressOffset>0x2bcc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1780</name>
        <addressOffset>0x2bd0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1781</name>
        <addressOffset>0x2bd4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1782</name>
        <addressOffset>0x2bd8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1783</name>
        <addressOffset>0x2bdc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1784</name>
        <addressOffset>0x2be0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1785</name>
        <addressOffset>0x2be4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1786</name>
        <addressOffset>0x2be8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1787</name>
        <addressOffset>0x2bec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1788</name>
        <addressOffset>0x2bf0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1789</name>
        <addressOffset>0x2bf4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1790</name>
        <addressOffset>0x2bf8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1791</name>
        <addressOffset>0x2bfc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1792</name>
        <addressOffset>0x2c00</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1793</name>
        <addressOffset>0x2c04</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1794</name>
        <addressOffset>0x2c08</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1795</name>
        <addressOffset>0x2c0c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1796</name>
        <addressOffset>0x2c10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1797</name>
        <addressOffset>0x2c14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1798</name>
        <addressOffset>0x2c18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1799</name>
        <addressOffset>0x2c1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1800</name>
        <addressOffset>0x2c20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1801</name>
        <addressOffset>0x2c24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1802</name>
        <addressOffset>0x2c28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1803</name>
        <addressOffset>0x2c2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1804</name>
        <addressOffset>0x2c30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1805</name>
        <addressOffset>0x2c34</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1806</name>
        <addressOffset>0x2c38</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1807</name>
        <addressOffset>0x2c3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1808</name>
        <addressOffset>0x2c40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1809</name>
        <addressOffset>0x2c44</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1810</name>
        <addressOffset>0x2c48</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1811</name>
        <addressOffset>0x2c4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1812</name>
        <addressOffset>0x2c50</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1813</name>
        <addressOffset>0x2c54</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1814</name>
        <addressOffset>0x2c58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1815</name>
        <addressOffset>0x2c5c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1816</name>
        <addressOffset>0x2c60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1817</name>
        <addressOffset>0x2c64</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1818</name>
        <addressOffset>0x2c68</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1819</name>
        <addressOffset>0x2c6c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1820</name>
        <addressOffset>0x2c70</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1821</name>
        <addressOffset>0x2c74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1822</name>
        <addressOffset>0x2c78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1823</name>
        <addressOffset>0x2c7c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1824</name>
        <addressOffset>0x2c80</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1825</name>
        <addressOffset>0x2c84</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1826</name>
        <addressOffset>0x2c88</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1827</name>
        <addressOffset>0x2c8c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1828</name>
        <addressOffset>0x2c90</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1829</name>
        <addressOffset>0x2c94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1830</name>
        <addressOffset>0x2c98</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1831</name>
        <addressOffset>0x2c9c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1832</name>
        <addressOffset>0x2ca0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1833</name>
        <addressOffset>0x2ca4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1834</name>
        <addressOffset>0x2ca8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1835</name>
        <addressOffset>0x2cac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1836</name>
        <addressOffset>0x2cb0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1837</name>
        <addressOffset>0x2cb4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1838</name>
        <addressOffset>0x2cb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1839</name>
        <addressOffset>0x2cbc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1840</name>
        <addressOffset>0x2cc0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1841</name>
        <addressOffset>0x2cc4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1842</name>
        <addressOffset>0x2cc8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1843</name>
        <addressOffset>0x2ccc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1844</name>
        <addressOffset>0x2cd0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1845</name>
        <addressOffset>0x2cd4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1846</name>
        <addressOffset>0x2cd8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1847</name>
        <addressOffset>0x2cdc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1848</name>
        <addressOffset>0x2ce0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1849</name>
        <addressOffset>0x2ce4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1850</name>
        <addressOffset>0x2ce8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1851</name>
        <addressOffset>0x2cec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1852</name>
        <addressOffset>0x2cf0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1853</name>
        <addressOffset>0x2cf4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1854</name>
        <addressOffset>0x2cf8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1855</name>
        <addressOffset>0x2cfc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1856</name>
        <addressOffset>0x2d00</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1857</name>
        <addressOffset>0x2d04</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1858</name>
        <addressOffset>0x2d08</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1859</name>
        <addressOffset>0x2d0c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1860</name>
        <addressOffset>0x2d10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1861</name>
        <addressOffset>0x2d14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1862</name>
        <addressOffset>0x2d18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1863</name>
        <addressOffset>0x2d1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1864</name>
        <addressOffset>0x2d20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1865</name>
        <addressOffset>0x2d24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1866</name>
        <addressOffset>0x2d28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1867</name>
        <addressOffset>0x2d2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1868</name>
        <addressOffset>0x2d30</addressOffset>
        <size>0x20</size>
      </register>
